# 전자제조데이터분석 과제 02
## 제출: eclass 과제메뉴 02
- 각 코드 블럭의 출력 결과까지 저장하여 제출해주세요.
- 최대한 본인의 힘으로 해결하세요. (중간고사과 유사한 스타일)
- 각 코드의 동작방식을 반드시! 주석으로 설명해주세요.
- ipynb 파일을 그대로 제출해주세요.

##기한: 2021.10.23 23:59

학번: ___________21510013______________
이름: ______________유진이___________

참고해야 할 문서: Padnas API Reference 

https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/index.html

팁:
- read_csv(): csv 파일을 읽기 위한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/api/pandas.read_csv.html#pandas.read_csv)
- dataframe.*: dataframe을 다루기 위한 다양한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/frame.html)



### Step 1. pandas 모듈을 import 하세요.

In [2]:
# pandas는 다음의 종류의 데이터에 적합한 분석 패키지
# 1. sql 테이블 또는 excel 스프레드 시트에서와 같이 이질적으로 유형이 지정된 열이있는 테이블 형식 데이터 
# 2. 정렬되고 정렬되지 않은 시계열 데이터
# 3. 행 및 열 레이블이 포함 된 임의의 행렬 데이터 
# 4. 다른 형태의 관찰 / 통계 데이터 세트 

import pandas as pd

### Step 2. 제공된 데이터 파일을 업로드하세요.

In [3]:
# 제공된 파일 같은 폴더에 위치시킴

### Step 3. 업로드한 파일을 읽어 dataframe을 추출한 후 (pd.read_csv() 활용), 특정 변수에 저장하세요. 이때, 'user_id' 열을 dataframe의 인덱스로 활용하세요.

In [4]:
# pd.read_csv() 를 통해 txt 파일은 csv 파일로 불러오기 
data = pd.read_csv('w6data.txt')
data[:2] # 두개의 행 출력해보기 
# set_index 메서드로 특정한 열을 인덱스로 설정할 수 있음. 이 때 기존의 인덱스는 없어짐 
data = data.set_index('user_id')

### Step 4. 첫 25개 항목을 출력하세요.

In [5]:
# head()는 불러온 데이터의 상위 5개의 행을 출력함 -> 원하는 갯수 설정 가능 
data.head(25)
# data[:26] # 다음과 같은 방식으로 출력도 가능

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. 마지막 10개 항목을 출력하세요.

In [6]:
# tail()는 불러온 데이터의 하위 5개의 행을 출력함 -> 원하는 갯수 설정 가능 
data.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. 데이터 파일에 총 몇개의 항목이 존재하는지 구해보세요.

In [7]:
# .shape의 속성을 이용하면 데이터의 (행,열) 크기를 확인할 수있음 -> 그 중에서 데이터 파일의 갯수는 행의 갯수를 세면 됌!
data.shape[0]

943

### Step 7. Dataframe에 몇 개의 열(column)이 존재하나요?

In [8]:
# .shape의 속성을 이용하면 데이터의 (행,열) 크기를 확인할 수있음 
data.shape[-1]

4

### Step 8. Dataframe 내 모든 열(column)의 이름을 출력해보세요.

In [9]:
# .columns 속성을 이용하면 해당 데이터프레임을 구성하는 컬럼명을 확인할 수 있음 
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. Dataframe의 인덱싱이 어떻게 되어있는지 출력해보세요.

In [10]:
# "the index" (aka "the labels")
# .index를 활용해 데이터프레임의 인덱싱이 어떻게 되었는지 확인할 수 있음 
data.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. 각 열(column)의 data type을 출력해보세요.

In [11]:
# .dtypes의 속성을 통해서 각 열에 해당하는 값의 type을 알 수 있음 
# type은 int, float, object 등이 존재함 
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. occupation 열(column)만 출력해보세요.

### Step 11. occupation 열(column)만 출력해보세요.

In [23]:
# data[['occupation']] <- 참고로 다음과 같이 출력하면 데이터 프레임 타입으로 출력됌 

data['occupation'] # series type으로 출력됌

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. 데이터 파일에 몇 개의 서로 다른 occupation이 존재하나요?

### Step 12. 데이터 파일에 몇 개의 서로 다른 occupation이 존재하나요?

In [24]:
# unique() : 고유값들의 종류 파악
# nunique() : 데이터에 고유값들의 수를 출력해주는 함수  -> 이 함수 사용 
# value_counts() : 값별로 데이터의 수를 출력해주는 함수 

data['occupation'].nunique()

21

### Step 13. 가장 많이 등장하는 occupation은 무엇인가요?

In [16]:
# 'occupation'열의 값 중에서 ->  value_counts()함수를 이용해 값 별로 데이터의 수를 내림차순으로 정렬 -> 가장맨 위에 있는 값의 index가 해당함 
data['occupation'].value_counts().index[0]

'student'

### Step 14. Dataframe내 모든 열(column)에 대하여 다양한 통계정보를 출력해보세요.

In [17]:
# .describe는 기술통계량을 보여주는 함수 -> include ='all'을 사용할 경우 모든 열이 데이터 출력으로 포함 됨 
data.describe(include ='all')[:7]

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN

### Step 15. 사용자들의 평균 나이는 몇살인가요?

In [18]:
# mean()함수를 이용해 평균을 구함 -> int함수를 통해 float type을 int로 바꿔줌 
int(data['age'].mean())

34

### Step 16. 가장 적게 등장한 사용자들 중 최연소자의 나이는 몇인가요?

In [19]:
age = {} # 나이의 고유값들의 수를 저장하는 딕셔너리 생성 
min_index = [] # 가장 적게 등장하는 경우의 index를 저장하는 리스트 생성 
for index,value in data['age'].value_counts(ascending = True).items(): # 나이의 고유값의 수를 오름차순으로 정렬한 뒤, index와 value로 할당함
    age[index] = value # 딕셔너리 내에 unique한 나이, 등장 횟수를 계속 넣음
    if value == min(age.values()) : # 만약 가장 작은 값에 해당한다면, min_index에 넣기 -> 가능한 이유는 위에서 오름차순으로 정렬했기때문에 작은것이 먼저 들어가기 때문
        min_index.append(index)
print(min(min_index)) # 가장 적게 등장하는 것중에서 가장 적은 나이를 출력할 수 있음

7

In [20]:
# # 야매 방법 -> 하지만, 부정확 [:5]까지가 1이라는 것은 찍어봤기 때문에 아는 것 
# min(data['age'].value_counts(ascending = True)[:5].keys())